|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
import pandas as pd

In [2]:
import matplotlib.pyplot as plt

In [3]:
import numpy as np

In [41]:
#Read data and describe it

df=pd.read_csv("C:/Users/user/Documents/G3/Numpy/Practise/titanic_dataset.csv")
df.describe()

,Unnamed: 0,pclass,survived,age,sibsp,parch,body
count,1309.000000,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,121.000000
mean,654.000000,2.294882,0.381971,29.881135,0.498854,0.385027,160.809917
std,378.020061,0.837836,0.486055,14.413500,1.041658,0.865560,97.696922
min,0.000000,1.000000,0.000000,0.166700,0.000000,0.000000,1.000000
25%,327.000000,2.000000,0.000000,21.000000,0.000000,0.000000,72.000000
50%,654.000000,3.000000,0.000000,28.000000,0.000000,0.000000,155.000000
75%,981.000000,3.000000,1.000000,39.000000,1.000000,0.000000,256.000000
max,1308.000000,3.000000,1.000000,80.000000,8.000000,9.000000,328.000000

In [5]:
#Print shape of dataset
df.shape

(1309, 15)

In [6]:
#drop columns with more than 25% missing data


df.isnull().sum()

Unnamed: 0       0
pclass           0
survived         0
name             0
gender           0
age            263
sibsp            0
parch            0
ticket           0
fare             1
cabin         1014
embarked         2
boat           823
body          1188
home.dest      564
dtype: int64

In [42]:
(df.isnull().sum()/df.shape[0])*100

Unnamed: 0     0.000000
pclass         0.000000
survived       0.000000
name           0.000000
gender         0.000000
age           20.091673
sibsp          0.000000
parch          0.000000
ticket         0.000000
fare           0.076394
cabin         77.463713
embarked       0.152788
boat          62.872422
body          90.756303
home.dest     43.086325
dtype: float64

In [43]:
df.drop(["cabin","boat","body","home.dest"],axis=1,inplace=True)

In [44]:
#drop columns having independent values(which do not affect the survival rate).
df.drop(["Unnamed: 0","name","ticket"],axis=1,inplace=True)

In [45]:
# check data types of all columns
df.dtypes

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
fare         object
embarked     object
dtype: object

In [53]:
# convert price to numeric
df.fare.replace({"\$":""},regex=True,inplace=True)

In [54]:
df.fare.dtype

dtype('O')

In [55]:
df.fare=df.fare.astype("float16")

In [56]:
df.fare.dtype

dtype('float16')

In [57]:
# find columns still having missing/na values and also count of missing data
df.fare.isnull().sum()
df.age.isnull().sum()

0

In [59]:
df.describe()

,pclass,survived,age,sibsp,parch,fare
count,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000,1308.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.281250
std,0.837836,0.486055,12.883199,1.041658,0.865560,inf
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000
25%,2.000000,0.000000,22.000000,0.000000,0.000000,7.898438
50%,3.000000,0.000000,29.881135,0.000000,0.000000,14.453125
75%,3.000000,1.000000,35.000000,1.000000,0.000000,31.281250
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.500000

In [60]:
# fill na with mean for fare and age column column.

df.fare.fillna(df.fare.mean(),inplace=True)

In [61]:
df.age.fillna(df.age.mean(),inplace=True)

In [62]:
# drop na values for embarked column.
df.embarked.isnull().sum()

2

In [63]:
df.embarked.fillna(df.embarked.mode()[0],inplace=True)

In [64]:
df.embarked.isnull().sum()

0

In [65]:
df.describe()

,pclass,survived,age,sibsp,parch,fare
count,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.281250
std,0.837836,0.486055,12.883199,1.041658,0.865560,inf
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000
25%,2.000000,0.000000,22.000000,0.000000,0.000000,7.898438
50%,3.000000,0.000000,29.881135,0.000000,0.000000,14.453125
75%,3.000000,1.000000,35.000000,1.000000,0.000000,31.281250
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.500000

In [23]:
# # dump the dataframe to a csv file 'titanic_filtered.csv'.

In [37]:
# for survived column replace 0 with D and 1 with A
#d =  [(23,"Gaurav"),(33,"Abhishek"),(20,"Krishna")
#d =  [(23,"Gaurav"),(33,"Abhishek"),(20,"Krishna")]
# dff = pd.DataFrame(df, columns=['D','A'])
# print(df)

In [66]:
# find the frequency of different values in survived columns

df.survived.value_counts()

0    809
1    500
Name: survived, dtype: int64

In [72]:
# group by gender and survived and see the counts in each category
grp1=df.groupby(["gender","survived"])
print(grp1)
grp1.groups

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000007450F58A88>

{('female',
  0): Int64Index([   2,    4,  105,  169,  286,  365,  369,  381,  382,  411,
             ...
             1227, 1230, 1231, 1265, 1267, 1273, 1276, 1279, 1304, 1305],
            dtype='int64', length=127),
 ('female',
  1): Int64Index([   0,    6,    8,   11,   12,   13,   17,   18,   21,   23,
             ...
             1223, 1244, 1247, 1257, 1258, 1260, 1261, 1286, 1290, 1300],
            dtype='int64', length=339),
 ('male',
  0): Int64Index([   3,    7,    9,   10,   15,   16,   19,   25,   30,   34,
             ...
             1296, 1297, 1298, 1299, 1301, 1302, 1303, 1306, 1307, 1308],
            dtype='int64', length=682),
 ('male',
  1): Int64Index([   1,    5,   14,   20,   22,   26,   29,   31,   37,   47,
             ...
             1196, 1228, 1232, 1233, 1236, 1238, 1240, 1254, 1256, 1277],
            dtype='int64', length=161)}

In [76]:
# find different pclass and no of people in each class
df.pclass.value_counts()

3    709
1    323
2    277
Name: pclass, dtype: int64

In [117]:
# find top 5 people with highest values of age. Count no of male and females in the top 5
#grp=df.groupby(by="age")
ag1 = df.age[df.age>70]
ag1.head()

9      71.0
14     80.0
61     76.0
135    71.0
727    70.5
Name: age, dtype: float64

In [121]:
df.age.unique

<bound method Series.unique of 0       29.000000
1        0.916700
2        2.000000
3       30.000000
4       25.000000
          ...
1304    14.500000
1305    29.881135
1306    26.500000
1307    27.000000
1308    29.000000
Name: age, Length: 1309, dtype: float64>

In [94]:
# find max age male and female who survived
grp1.max()

                 pclass   age  sibsp  parch    fare embarked
gender survived
female 0              3  63.0      8      9  221.75        S
       1              3  76.0      4      5  512.50        S
male   0              3  74.0      8      9  263.00        S
       1              3  80.0      4      2  512.50        S

In [95]:
df.describe()

,pclass,survived,age,sibsp,parch,fare
count,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.281250
std,0.837836,0.486055,12.883199,1.041658,0.865560,inf
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000
25%,2.000000,0.000000,22.000000,0.000000,0.000000,7.898438
50%,3.000000,0.000000,29.881135,0.000000,0.000000,14.453125
75%,3.000000,1.000000,35.000000,1.000000,0.000000,31.281250
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.500000

In [108]:
# get average age by gender
grp = df.groupby(by="age")
#print(grp.groups)
print(grp.age.value_counts())

print()
grp = df.groupby(by="gender")
print(grp.age.mean())

print(grp)
#print(dir(grp))

age      age
0.1667   0.1667     1
0.3333   0.3333     1
0.4167   0.4167     1
0.6667   0.6667     1
0.7500   0.7500     3
                   ..
70.5000  70.5000    1
71.0000  71.0000    2
74.0000  74.0000    1
76.0000  76.0000    1
80.0000  80.0000    1
Name: age, Length: 99, dtype: int64

gender
female    28.886935
male      30.430716
Name: age, dtype: float64
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000000744D04EF88>

In [109]:
# get average age by people survived vs not-survived
grp = df.groupby(by="survived")
print(grp.age.mean())

survived
0    30.389368
1    29.058812
Name: age, dtype: float64